pruebas/guion_sii_recibidas.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:siiLR="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroLR.xsd"
xmlns:sii="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroInformacion.xsd">
<soapenv:Header/>
   <soapenv:Body>
      <siiLR:SuministroLRFacturasRecibidas>
         <sii:Cabecera>
            <sii:IDVersionSii>1.1</sii:IDVersionSii>
            <sii:Titular>
               <sii:NombreRazon>DIAGRAM SOFTWARE,S.L.</sii:NombreRazon>
               <sii:NIF>B53179768</sii:NIF>
            </sii:Titular>
            <sii:TipoComunicacion>A0</sii:TipoComunicacion>
         </sii:Cabecera>
         <siiLR:RegistroLRFacturasRecibidas>
            <sii:PeriodoLiquidacion>
               <sii:Ejercicio>2024</sii:Ejercicio>
               <sii:Periodo>06</sii:Periodo>
            </sii:PeriodoLiquidacion>
            <siiLR:IDFactura>
               <sii:IDEmisorFactura>
                  <sii:NIF>B65925869</sii:NIF>
               </sii:IDEmisorFactura>
               <sii:NumSerieFacturaEmisor>65606506</sii:NumSerieFacturaEmisor>
               <sii:FechaExpedicionFacturaEmisor>12-06-2024</sii:FechaExpedicionFacturaEmisor>
            </siiLR:IDFactura>
            <siiLR:FacturaRecibida>
               <sii:TipoFactura>F1</sii:TipoFactura>
               <sii:ClaveRegimenEspecialOTrascendencia>01</sii:ClaveRegimenEspecialOTrascendencia>
               <sii:ImporteTotal>1210</sii:ImporteTotal>
               <sii:DescripcionOperacion>S/FRA. 65606506</sii:DescripcionOperacion>
               <sii:DesgloseFactura>
                  <sii:DesgloseIVA>
                     <sii:DetalleIVA>
                        <sii:TipoImpositivo>21</sii:TipoImpositivo>
                        <sii:BaseImponible>1000</sii:BaseImponible>
                        <sii:CuotaSoportada>210</sii:CuotaSoportada>
                     </sii:DetalleIVA>
                  </sii:DesgloseIVA>
               </sii:DesgloseFactura>
               <sii:Contraparte>
                  <sii:NombreRazon>LA ZENTRAL 3.0-NOVA DISTRIBUCION, S.L.</sii:NombreRazon>
                  <sii:NIF>B65925869</sii:NIF>
               </sii:Contraparte>
               <sii:FechaRegContable>12-06-2024</sii:FechaRegContable>
               <sii:CuotaDeducible>210</sii:CuotaDeducible>
            </siiLR:FacturaRecibida>
         </siiLR:RegistroLRFacturasRecibidas>
         <siiLR:RegistroLRFacturasRecibidas>
            <sii:PeriodoLiquidacion>
               <sii:Ejercicio>2024</sii:Ejercicio>
               <sii:Periodo>06</sii:Periodo>
            </sii:PeriodoLiquidacion>
            <siiLR:IDFactura>
               <sii:IDEmisorFactura>
                  <sii:NIF>29048846F</sii:NIF>
               </sii:IDEmisorFactura>
               <sii:NumSerieFacturaEmisor>66/24</sii:NumSerieFacturaEmisor>
               <sii:FechaExpedicionFacturaEmisor>30-06-2024</sii:FechaExpedicionFacturaEmisor>
            </siiLR:IDFactura>
            <siiLR:FacturaRecibida>
               <sii:TipoFactura>F1</sii:TipoFactura>
               <sii:ClaveRegimenEspecialOTrascendencia>01</sii:ClaveRegimenEspecialOTrascendencia>
               <sii:ImporteTotal>1815</sii:ImporteTotal>
               <sii:DescripcionOperacion>COMPRAS</sii:DescripcionOperacion>
               <sii:DesgloseFactura>
                  <sii:DesgloseIVA>
                     <sii:DetalleIVA>
                        <sii:TipoImpositivo>21</sii:TipoImpositivo>
                        <sii:BaseImponible>1500</sii:BaseImponible>
                        <sii:CuotaSoportada>315</sii:CuotaSoportada>
                     </sii:DetalleIVA>
                  </sii:DesgloseIVA>
               </sii:DesgloseFactura>
               <sii:Contraparte>
                  <sii:NombreRazon>MARTINEZ BERNAL, JOSE FRANCISCO</sii:NombreRazon>
                  <sii:NIF>29048846F</sii:NIF>
               </sii:Contraparte>
               <sii:FechaRegContable>30-06-2024</sii:FechaRegContable>
               <sii:CuotaDeducible>315</sii:CuotaDeducible>
            </siiLR:FacturaRecibida>
         </siiLR:RegistroLRFacturasRecibidas>
         <siiLR:RegistroLRFacturasRecibidas>
            <sii:PeriodoLiquidacion>
               <sii:Ejercicio>2024</sii:Ejercicio>
               <sii:Periodo>06</sii:Periodo>
            </sii:PeriodoLiquidacion>
            <siiLR:IDFactura>
               <sii:IDEmisorFactura>
                  <sii:NIF>B80070790</sii:NIF>
               </sii:IDEmisorFactura>
               <sii:NumSerieFacturaEmisor>29.06/24</sii:NumSerieFacturaEmisor>
               <sii:FechaExpedicionFacturaEmisor>29-06-2024</sii:FechaExpedicionFacturaEmisor>
            </siiLR:IDFactura>
            <siiLR:FacturaRecibida>
               <sii:TipoFactura>F1</sii:TipoFactura>
               <sii:ClaveRegimenEspecialOTrascendencia>01</sii:ClaveRegimenEspecialOTrascendencia>
               <sii:ImporteTotal>5377.24</sii:ImporteTotal>
               <sii:DescripcionOperacion>COMPRAS</sii:DescripcionOperacion>
               <sii:DesgloseFactura>
                  <sii:DesgloseIVA>
                     <sii:DetalleIVA>
                        <sii:TipoImpositivo>21</sii:TipoImpositivo>
                        <sii:BaseImponible>4444</sii:BaseImponible>
                        <sii:CuotaSoportada>933.24</sii:CuotaSoportada>
                     </sii:DetalleIVA>
                  </sii:DesgloseIVA>
               </sii:DesgloseFactura>
               <sii:Contraparte>
                  <sii:NombreRazon>PANIFICADORA PANALCOR, S.L.</sii:NombreRazon>
                  <sii:NIF>B80070790</sii:NIF>
               </sii:Contraparte>
               <sii:FechaRegContable>29-06-2024</sii:FechaRegContable>
               <sii:CuotaDeducible>933.24</sii:CuotaDeducible>
            </siiLR:FacturaRecibida>
         </siiLR:RegistroLRFacturasRecibidas>
         <siiLR:RegistroLRFacturasRecibidas>
            <sii:PeriodoLiquidacion>
               <sii:Ejercicio>2024</sii:Ejercicio>
               <sii:Periodo>06</sii:Periodo>
            </sii:PeriodoLiquidacion>
            <siiLR:IDFactura>
               <sii:IDEmisorFactura>
                  <sii:NIF>A03175411</sii:NIF>
               </sii:IDEmisorFactura>
               <sii:NumSerieFacturaEmisor>28.06/24</sii:NumSerieFacturaEmisor>
               <sii:FechaExpedicionFacturaEmisor>28-06-2024</sii:FechaExpedicionFacturaEmisor>
            </siiLR:IDFactura>
            <siiLR:FacturaRecibida>
               <sii:TipoFactura>F1</sii:TipoFactura>
               <sii:ClaveRegimenEspecialOTrascendencia>01</sii:ClaveRegimenEspecialOTrascendencia>
               <sii:ImporteTotal>4032.93</sii:ImporteTotal>
               <sii:DescripcionOperacion>COMPRAS</sii:DescripcionOperacion>
               <sii:DesgloseFactura>
                  <sii:DesgloseIVA>
                     <sii:DetalleIVA>
                        <sii:TipoImpositivo>21</sii:TipoImpositivo>
                        <sii:BaseImponible>3333</sii:BaseImponible>
                        <sii:CuotaSoportada>699.93</sii:CuotaSoportada>
                     </sii:DetalleIVA>
                  </sii:DesgloseIVA>
               </sii:DesgloseFactura>
               <sii:Contraparte>
                  <sii:NombreRazon>DIALQUE, S.A.U.</sii:NombreRazon>
                  <sii:NIF>A03175411</sii:NIF>
               </sii:Contraparte>
               <sii:FechaRegContable>28-06-2024</sii:FechaRegContable>
               <sii:CuotaDeducible>699.93</sii:CuotaDeducible>
            </siiLR:FacturaRecibida>
         </siiLR:RegistroLRFacturasRecibidas>
      </siiLR:SuministroLRFacturasRecibidas>
   </soapenv:Body>
</soapenv:Envelope>
