sii/xml_examples/ejemplo_xml_alta_factura_recibida.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:siiLR="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroLR.xsd"
                  xmlns:sii="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroInformacion.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <siiLR:SuministroLRFacturasRecibidas>
            <sii:Cabecera>
                <sii:IDVersionSii>0.6</sii:IDVersionSii>
                <sii:Titular>
                    <sii:NombreRazon>EMPRESAYYYYY</sii:NombreRazon>
                    <sii:NIF>N0041746I</sii:NIF>
                </sii:Titular>
                <sii:TipoComunicacion>A0</sii:TipoComunicacion>
            </sii:Cabecera>
            <siiLR:RegistroLRFacturasRecibidas>
                <sii:PeriodoImpositivo>
                    <sii:Ejercicio>2017</sii:Ejercicio>
                    <sii:Periodo>03</sii:Periodo>
                </sii:PeriodoImpositivo>
                <siiLR:IDFactura>
                    <sii:IDEmisorFactura>
                        <sii:NIF>A84532501</sii:NIF>
                    </sii:IDEmisorFactura>
                    <sii:NumSerieFacturaEmisor>000000000002</sii:NumSerieFacturaEmisor>
                    <sii:FechaExpedicionFacturaEmisor>01-03-2017</sii:FechaExpedicionFacturaEmisor>
                </siiLR:IDFactura>
                <siiLR:FacturaRecibida>
                    <sii:TipoFactura>F1</sii:TipoFactura>
                    <sii:FechaOperacion>01-03-2016</sii:FechaOperacion>
                    <sii:ClaveRegimenEspecialOTrascendencia>01</sii:ClaveRegimenEspecialOTrascendencia>
                    <sii:DescripcionOperacion>Objeto de la factura</sii:DescripcionOperacion>
                    <sii:DesgloseFactura>
                        <sii:InversionSujetoPasivo>
                            <sii:DetalleIVA>
                                <sii:TipoImpositivo>21</sii:TipoImpositivo>
                                <sii:BaseImponible>800</sii:BaseImponible>
                                <sii:CuotaSoportada>168</sii:CuotaSoportada>
                            </sii:DetalleIVA>
                        </sii:InversionSujetoPasivo>
                        <sii:DesgloseIVA>
                            <sii:DetalleIVA>
                                <sii:TipoImpositivo>21</sii:TipoImpositivo>
                                <sii:BaseImponible>118.5</sii:BaseImponible>
                                <sii:CuotaSoportada>31.5</sii:CuotaSoportada>
                            </sii:DetalleIVA>
                        </sii:DesgloseIVA>
                    </sii:DesgloseFactura>
                    <sii:Contraparte>
                        <sii:NombreRazon>EMPRESAXXX</sii:NombreRazon>
                        <sii:NIF>A84532501</sii:NIF>
                    </sii:Contraparte>
                    <sii:FechaRegContable>01-03-2017</sii:FechaRegContable>
                    <sii:CuotaDeducible>60</sii:CuotaDeducible>
                </siiLR:FacturaRecibida>
            </siiLR:RegistroLRFacturasRecibidas>
        </siiLR:SuministroLRFacturasRecibidas>
    </soapenv:Body>
</soapenv:Envelope>