data/B12323648_R_FR_A0_2024_02_28_08_33_27_821.E.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:siiLR="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroLR.xsd" xmlns:sii="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroInformacion.xsd">
	<soapenv:Header/>
	<soapenv:Body>
		<siiLR:SuministroLRFacturasRecibidas>
			<sii:Cabecera>
				<sii:IDVersionSii>1.1</sii:IDVersionSii>
				<sii:Titular>
					<sii:NombreRazon>Distribuciones Rosell SL</sii:NombreRazon>
					<sii:NIF>B12323648</sii:NIF>
				</sii:Titular>
				<sii:TipoComunicacion>A0</sii:TipoComunicacion>
			</sii:Cabecera>
			<siiLR:RegistroLRFacturasRecibidas>
				<sii:PeriodoLiquidacion>
					<sii:Ejercicio>2024</sii:Ejercicio>
					<sii:Periodo>02</sii:Periodo>
				</sii:PeriodoLiquidacion>
				<siiLR:IDFactura>
					<sii:IDEmisorFactura>
						<sii:NIF>A08000820</sii:NIF>
					</sii:IDEmisorFactura>
					<sii:NumSerieFacturaEmisor>16092483</sii:NumSerieFacturaEmisor>
					<sii:FechaExpedicionFacturaEmisor>15-02-2024</sii:FechaExpedicionFacturaEmisor>
				</siiLR:IDFactura>
				<siiLR:FacturaRecibida>
					<sii:TipoFactura>F1</sii:TipoFactura>
					<sii:ClaveRegimenEspecialOTrascendencia>01</sii:ClaveRegimenEspecialOTrascendencia>
					<sii:ImporteTotal>48885.10</sii:ImporteTotal>
					<sii:DescripcionOperacion>Compra de bienes y/o servicios a CERVEZAS DAMM, f. 16092483</sii:DescripcionOperacion>
					<sii:DesgloseFactura>
						<sii:DesgloseIVA>
							<sii:DetalleIVA>
								<sii:TipoImpositivo>21.00</sii:TipoImpositivo>
								<sii:BaseImponible>40400.91</sii:BaseImponible>
								<sii:CuotaSoportada>8484.19</sii:CuotaSoportada>
							</sii:DetalleIVA>
						</sii:DesgloseIVA>
					</sii:DesgloseFactura>
					<sii:Contraparte>
						<sii:NombreRazon>CERVEZAS DAMM</sii:NombreRazon>
						<sii:NIF>A08000820</sii:NIF>
					</sii:Contraparte>
					<sii:FechaRegContable>28-02-2024</sii:FechaRegContable>
					<sii:CuotaDeducible>8484.19</sii:CuotaDeducible>
				</siiLR:FacturaRecibida>
			</siiLR:RegistroLRFacturasRecibidas>
		</siiLR:SuministroLRFacturasRecibidas>
	</soapenv:Body>
</soapenv:Envelope>
